export default {
  login: {
    '-3': '没有找到此用户',
    '-4': '用户名或者密码错误',
    '-5': '请输入合法的用户名或者密码',
    '-7': '用户没有登录该客户端的权限',
    '-25': '用户被禁用'
  },
  default: {
    '0': '请求失败,请检查网络',
    '-1': '数据库出错',
    '-2': '未登录或登录信息过期',
    '-3': '未找到数据',
    '-4': '用户名或密码错误',
    '-5': '参数不正确',
    '-6': '数据冲突',
    '-7': '你没有执行此操作的权限',
    '-9': '从服务器读取数据出错',
    '-12': '你操作的对象不存在',
    '-14': '服务器返回了一个IO错误',
    '-15': '你的账号已经在别处登录,请重新登录',
    '-25': '你的用户/角色被禁用',
    '401': '你没有执行此操作的权限,请确定你是否是管理员，或者身份信息已过期，请重新登录',
    '403': '服务器拒绝访问',
    '404': '你访问的资源不存在（404）',
    '408': '请求超时',
    '500': '服务器内部错误',
    '501': '服务未实现',
    '502': '网关错误',
    '503': '服务器过载或暂停维修',
    '504': '网关超时',
    '12029': '网络不通畅，请刷新页面',
    '-255': '服务器返回了一个未知错误'
  }
}
